Конфигурация/Documents/ФискальныйПриходТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФискальныйПриходТоваров</Name>
			<Comment>Оприходование акцизных товаров в фискальный контур</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФискальныеОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ФискальныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ФискальныеОстатки</Name>
			<Comment>Остатки акцизных товаров в фискальном контуре (ФОП + Номенклатура)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Documents/ФискальныйПриходТоваров/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ФискальныеОстатки.Записывать = Истина;
	
	Для Каждого ТекСтрока Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ФискальныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ФОП = ФОП;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Количество = ТекСтрока.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(ФОП) Тогда
		ОбщегоНазначения.СообщитьПользователю("Укажите ФОП для фискального прихода.", , "ФОП", , Отказ);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекСтрока.Номенклатура.ТребуетАкцизнуюМарку Тогда
			ТекстОшибки = "В фискальный приход можно добавлять только акцизные товары. Не подходит: "
				+ Строка(ТекСтрока.Номенклатура);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ,
				"Товары[" + Формат(ТекСтрока.НомерСтроки - 1, "ЧГ=0") + "].Номенклатура", , Отказ);
		КонецЕсли;
		
		Если ТекСтрока.Количество <= 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Количество должно быть больше нуля.",
				, "Товары[" + Формат(ТекСтрока.НомерСтроки - 1, "ЧГ=0") + "].Количество", , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
